Pandas is a Python library designed specifically for data manipulation and analysis. It provides fast, flexible, and expressive data structures that make working with "relational" or "labeled" data both easy and intuitive. The two primary data structures provided by Pandas are Series and DataFrame, each serving different purposes for handling and analyzing data.


A Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floats, Python objects, etc.).

It is similar to a column in an Excel spreadsheet or a single column in a table.

A Series has both a data column and an index column, where the index acts as the label for the data.




 DataFrame


A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.

It can be thought of as a table or a spreadsheet in which each column is a Series.

A DataFrame can be created from a variety of data sources, such as dictionaries, lists, CSV files, databases, and more.

In [2]:
import pandas as pd

In [7]:
# Series
## A pandas series is a one dimensional array like object that can hold any data type. It is similar to a column in a table;
import pandas as pd
data=[1,2,3,5,6,4,3]
series=pd.Series(data)
print("series \n", series)
print(type(series))

series
 0    1
1    2
2    3
3    5
4    6
5    4
6    3
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
## create a series from dictionary 
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [9]:
data=[10,20,40]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    40
dtype: int64

In [10]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [3]:
import pandas as pd

In [6]:
df=pd.read_csv('sales.data.csv.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [5]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [13]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [14]:
## accesing data from dataframe
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [15]:
df['Name']

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [16]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [17]:
df.iloc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [18]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [20]:
df.at[1,'Age']

np.int64(34)

In [21]:
df.at[3,'Name']

'JAck'

In [22]:
## accesing a specified element using iat
df.iat[2,2]

'Bangalore'

In [23]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [25]:
## adding a columns
df['Salary']=[50000,43545,43543,54353]
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34  Bangalore   43545
2  Bappy   32  Bangalore   43543
3   JAck   32  Bangalore   54353

In [26]:
## remove a column
df.drop('Salary',axis=1)

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [27]:
df

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34  Bangalore   43545
2  Bappy   32  Bangalore   43543
3   JAck   32  Bangalore   54353

In [28]:
## remove a column
df.drop('Salary',axis=1,inplace=True)

In [29]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [30]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City
0  Krish   33  Bangalore
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [31]:
df.drop(0,inplace=True)

In [32]:
df

    Name  Age       City
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [33]:
df.drop(1,inplace=True)

In [34]:
df

    Name  Age       City
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [35]:
df=pd.read_csv('sales.data.csv.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [36]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [37]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000